---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.ForwardIterator
source: html/48f9bb6d-a231-41f8-47ca-830c00532043.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireMaterialTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.